<script setup lang="ts">
import CSendReport from '../../../components/CSendReport.vue';

</script>

<template>
    <h1>MVP</h1>

    <section>
        <h2><span>Описание</span></h2>
    
        <p>
            MVP - это шаблон, который также расширяет идеи MVC, но с фокусом на тестировании и разделении ответственности.

            <ul class="list-group">
                <li class="list-group-item">
                    <strong>Модель (Model): </strong> Отвечает за хранение данных и бизнес-логику. Модель не зависит от представления или контроллера и может существовать независимо от них.
                </li>

                <li class="list-group-item">
                    <strong>Представление (View): </strong> Отвечает за отображение данных пользователю. Представление получает данные из модели и отображает их пользователю. В MVC представление пассивно и не имеет прямого доступа к модели. Оно обновляется контроллером при изменении модели.
                </li>

                <li class="list-group-item">
                    <strong>Презентер (Presenter): </strong> Принимает ввод пользователя из представления и обновляет модель в соответствии с этим вводом. Презентер также обновляет представление на основе изменений в модели. В отличие от контроллера в MVC, презентер активно управляет жизненным циклом представления.
                </li>
            </ul>
        </p>
    
    </section>

    <section>
        <h2><span>Преимущества</span></h2>

        <ul class="list-group">
            <li class="list-group-item">
                Уменьшает связанность между представлением и моделью.
            </li>

            <li class="list-group-item">
                Упрощает тестирование, поскольку бизнес-логика приложения вынесена в презентеры, которые могут быть легко протестированы без участия пользовательского интерфейса.
            </li>

            <li class="list-group-item">
                Позволяет легко изменять представления без изменения логики приложения.
            </li>
        </ul>
    </section>


    <section>
        <h2><span>Недостатки</span></h2>

        <ul class="list-group">
            <li class="list-group-item">
                В некоторых случаях презентеры могут становиться слишком разрастающимися и сложными.
            </li>

            <li class="list-group-item">
                Требует более активного управления жизненным циклом.
            </li>
        </ul>
    </section>

    <section>
        <c-send-report pattern="MVP" />
    </section>
</template>

<style>

</style>